ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM46B/Periph_Driver/src/tmpm46b_uart.c
    /* Write software-reset command */
    tmp = UARTx->MOD2;
    tmp &= MOD2_SWRST_MASK;
    UARTx->MOD2 = tmp | MOD2_SWRST_CMD1;
    tmp &= MOD2_SWRST_MASK;
    UARTx->MOD2 = tmp | MOD2_SWRST_CMD2;
}

/**
  * @brief  Initialize the specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  InitStruct: The structure containing basic UART configuration.
  * @retval None
  * @note UART_SetInputClock need to use before UART_Init.
  */
void UART_Init(TSB_SC_TypeDef * UARTx, UART_InitTypeDef * InitStruct)
{
    uint32_t T0 = 0U;
    uint32_t T = 0U;
    uint32_t t = 0U;
    uint32_t N = 0U;
    uint32_t K = 0U;
    uint32_t tmp = 0U;
    uint32_t divider = 0U;
    const uint32_t a = 1U;
    const uint32_t b = 4U;

    /* Check the parameters */
    assert_param(IS_POINTER_NOT_NULL(InitStruct));
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_BAUDRATE(InitStruct->BaudRate));
    assert_param(IS_UART_DATA_BITS(InitStruct->DataBits));
    assert_param(IS_UART_STOPBITS(InitStruct->StopBits));
    assert_param(IS_UART_PARITY(InitStruct->Parity));
    assert_param(IS_UART_MODE(InitStruct->Mode));
    assert_param(IS_UART_FLOW_CONTROL(InitStruct->FlowCtrl));

    /* Configure the flow control */
    tmp = UARTx->MOD0;
    tmp &= MOD0_SM_MASK;
    tmp &= MOD0_CTSE_MASK;
    tmp &= MOD0_SC_MASK;
    tmp |= (InitStruct->DataBits | InitStruct->FlowCtrl);
    /* Use baud rate generator */
    tmp |= MOD0_SC_BRG;
    UARTx->MOD0 = tmp;

    /* Set the stop bit */
    tmp = UARTx->MOD2;
    tmp &= MOD2_SBLEN_MASK;
    tmp |= InitStruct->StopBits;
    tmp |= MOD2_WBUF_SET;
    UARTx->MOD2 = tmp;

    /* Enable or disable parity check */
    tmp = UARTx->CR;
    tmp &= CR_PARITY_MASK;
    tmp |= InitStruct->Parity;
    UARTx->CR = tmp;

    /* Get the peripheral I/O clock frequency */
    SystemCoreClockUpdate();

    T0 = SystemCoreClock / (a << ((TSB_CG->SYSCR >> 8U) & 7U));
    if (UARTx->EN & (0x1U << 1)) {
        /* Do nothing */
    } else {
        T0 /= 2U;
    }
    /* Baud rate setting */
    while ((divider < 200U) || (divider > 1600U)) {
        if (t == 0U) {
            T = 1U;
        } else {
            if (T < 128U) {
                T = T * b;
            } else {
                /* Do nothing */
            }
        }
        divider = (100U * (T0 >> 4U)) / (InitStruct->BaudRate * T);
        t++;
    }
    N = divider / 100U;
    tmp = UARTx->BRCR;
    if ((divider - (N * 100U)) == 0) {
        tmp &= ~BRCR_BRADDE_SET;
    } else {
        tmp |= BRCR_BRADDE_SET;
    }
    tmp &= BRCR_BRCK_MASK;
    tmp &= BRCR_BRS_MASK;
    tmp |= (((t - 1U) & 3U) << 4U);
    tmp |= (N & 0x0FU);
    tmp &= BRCR_CLEAR;
    UARTx->BRCR = tmp;
    if ((divider - (N * 100U)) == 0) {
        /* Do nothing */
    } else {
        K = (16U * (100U - (divider - (N * 100U)))) / 100U;
        if (K < 1U) {
            K = 1U;
        } else {
            /* Do nothing */
        }
        tmp = UARTx->BRADD;
        tmp &= BRADD_BRK_MASK;
        tmp |= (K & 0x0FU);
        UARTx->BRADD = tmp;
    }

    tmp = UARTx->MOD1;
    /* Enable or disable transmission or reception */
    switch (InitStruct->Mode) {
    case UART_ENABLE_RX:
        UARTx->MOD0 |= InitStruct->Mode;
        tmp &= MOD1_TXE_CLEAR;
        break;
    case UART_ENABLE_TX:
        UARTx->MOD0 &= MOD0_RXE_CLEAR;
        while ((UARTx->MOD0 & 0x20U) != 0){
            /* Wait until MOD0<RXE> is cleared */
        }
        tmp |= InitStruct->Mode;
        break;
    default:
        UARTx->MOD0 |= UART_ENABLE_RX;
        tmp |= UART_ENABLE_TX;
        break;
    }
    tmp &= MOD1_CLEAR;
    UARTx->MOD1 = tmp;
}

/**
  * @brief  Get received data of the specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @retval The received data
  */
uint32_t UART_GetRxData(TSB_SC_TypeDef * UARTx)
{
    uint32_t retval = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    /* Return received data */
    retval = (UARTx->CR & 0x80U) << 1U;
    retval = retval | (UARTx->BUF & 0xFFU);

    return retval;
}

/**
  * @brief  Set data to be sent and start transmitting via the specified
      UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  Data: the data to be sent.
  * @retval None
  */
void UART_SetTxData(TSB_SC_TypeDef * UARTx, uint32_t Data)
{
    uint32_t tmp = UARTx->MOD0 & 0x7FU;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_DATA(Data));

    /* Write MSB to SCxMOD0<TB8> at first if in 9-bit mode */
    tmp |= ((Data & 0x100U) >> 1U);
    UARTx->MOD0 = tmp;

    UARTx->BUF = Data & 0xFFU;
}

/**
  * @brief  Initialize the specified UART channel in default configuration.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @retval None
  */
void UART_DefaultConfig(TSB_SC_TypeDef * UARTx)
{
    UART_InitTypeDef uartdefault;
    uartdefault.BaudRate = 115200U;
    uartdefault.DataBits = UART_DATA_BITS_8;
    uartdefault.StopBits = UART_STOP_BITS_1;
    uartdefault.Parity = UART_NO_PARITY;
    uartdefault.Mode = UART_ENABLE_RX | UART_ENABLE_TX;
    uartdefault.FlowCtrl = UART_NONE_FLOW_CTRL;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    /* Enable the selected UART channel */
    UART_Enable(UARTx);
    /* Select baud rate generator as UART source clock */
    /* Set baud rate as 115200bps */
    /* Select 8-bit UART mode */
    /* Select 1-bit stop */
    /* No parity check */
    /* No flow control */
    /* Enable both transmission and reception */
    UART_Init(UARTx, &uartdefault);
}

/**
  * @brief  Indicate UART transfer error.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @retval The error flag.
  *   The value returned can be one of the followings:
  *   UART_NO_ERR, UART_OVERRUN, UART_PARITY_ERR, UART_FRAMING_ERR or UART_ERRS.
  */
UART_Err UART_GetErrState(TSB_SC_TypeDef * UARTx)
{
    uint8_t tmp = 0U;
    UART_Err retval = UART_NO_ERR;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));

    tmp = ((uint8_t) (UARTx->CR & CR_ERROR_MASK));
    switch (tmp) {
    case CR_OERR_FLAG:         /* Check overrun flag */
        retval = UART_OVERRUN;
        break;
    case CR_PERR_FLAG:         /* Check parity flag */
        retval = UART_PARITY_ERR;
        break;
    case CR_FERR_FLAG:         /* Check framing flag */
        retval = UART_FRAMING_ERR;
        break;
    default:
        if (tmp != 0U) {
            /* more than one error */
            retval = UART_ERRS;
        } else {
            /* Do nothing */
        }
        break;
    }

    return retval;
}

/**
  * @brief  Enable or disable the wake-up function in 9-bit UART mode
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of this function.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_SetWakeUpFunc(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set SCxMOD0<WU> to enable wake-up function */
        UARTx->MOD0 |= MOD0_WU_SET;
    } else {
        /* Clear SCxMOD0<WU> to disable wake-up function */
        UARTx->MOD0 &= MOD0_WU_CLEAR;
    }
}

/**
  * @brief  Enable or disable the specified UART channel when system is in IDLE
      mode.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of the UART channel in IDLE.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_SetIdleMode(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = UARTx->MOD1;
    if (NewState == ENABLE) {
        /* Set SCxMOD1<I2SC> to enable UARTx running in IDLE */
        tmp |= MOD1_I2SC_SET;
    } else {
        /* Clear SCxMOD1<I2SC> to disable UARTx running in IDLE */
        tmp &= MOD1_I2SC_CLEAR;
    }
    tmp &= MOD1_CLEAR;
    UARTx->MOD1 = tmp;
}

/**
  * @brief  Selects input clock for prescaler.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  clock: Selects input clock for prescaler as PhiT0/2 or PhiT0.
  *   This parameter can be:
  *         0: PhiT0/2
  *         1: PhiT0
  * @retval None
  * @note UART_SetInputClock need to use before UART_Init.
  */
void UART_SetInputClock(TSB_SC_TypeDef * UARTx, uint32_t clock)
{
    uint32_t tmp = 0U;

    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_CLOCK(clock));

    tmp = UARTx->EN;
    tmp &= EN_BRCKSEL_MASK;
    tmp |= (uint32_t) (clock << 1U);
    UARTx->EN = tmp;
}

/**
  * @brief  Enable or disable the FIFO of specified UART channel.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of the UART FIFO.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_FIFOConfig(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    if (NewState == ENABLE) {
        /* Set SCxFCNF<CNFG> to enable UARTx FIFO */
        UARTx->FCNF = tmp | FCNF_CNFG_SET;
    } else {
        /* Clear SCxFCNF<CNFG> to disable UARTx FIFO */
        UARTx->FCNF = tmp & FCNF_CNFG_CLEAR;
    }
}

/**
  * @brief  Transfer mode setting.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  TransferMode: Transfer mode.
  *   This parameter can be: UART_TRANSFER_PROHIBIT, UART_TRANSFER_HALFDPX_RX,
  *   UART_TRANSFER_HALFDPX_TX or UART_TRANSFER_FULLDPX.
  * @retval None
  */
void UART_SetFIFOTransferMode(TSB_SC_TypeDef * UARTx, uint32_t TransferMode)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_TRANSFER_MODE(TransferMode));

    tmp = UARTx->MOD1;
    tmp &= MOD1_FDPX_CLEAR;
    tmp |= TransferMode;
    UARTx->MOD1 = tmp;
}

/**
  * @brief  Controls automatic disabling of transmission and reception.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  TRxAutoDisable: Disabling transmission and reception or not.
  *   This parameter can be: UART_RXTXCNT_NONE or UART_RXTXCNT_AUTODISABLE .
  * @retval None
  */
void UART_TRxAutoDisable(TSB_SC_TypeDef * UARTx, UART_TRxDisable TRxAutoDisable)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UATR_TRX_AUTODISABLE(TRxAutoDisable));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    if (TRxAutoDisable == UART_RXTXCNT_AUTODISABLE) {
        /* Set SCxFCNF<RXTXCNT> to automatic disabling of transmission and reception */
        UARTx->FCNF = tmp | FCNF_RXTXCNT_SET;
    } else {
        /* Clear SCxFCNF<RXTXCNT> to do none */
        UARTx->FCNF = tmp & FCNF_RXTXCNT_CLEAR;
    }
}

/**
  * @brief  Enable or disable receive interrupt for receive FIFO.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of receive interrupt for receive FIFO.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_RxFIFOINTCtrl(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    if (NewState == ENABLE) {
        /* Set SCxFCNF<RFIE> to enable receive FIFO interrupt */
        UARTx->FCNF = tmp | FCNF_RFIE_SET;
    } else {
        /* Clear SCxFCNF<RFIE> to disable receive FIFO interrupt */
        UARTx->FCNF = tmp & FCNF_RFIE_CLEAR;
    }
}

/**
  * @brief  Enable or disable transmit interrupt for transmit FIFO.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  NewState: New state of transmit interrupt for transmit FIFO.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void UART_TxFIFOINTCtrl(TSB_SC_TypeDef * UARTx, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    if (NewState == ENABLE) {
        /* Set SCxFCNF<TFIE> to enable transmit FIFO interrupt */
        UARTx->FCNF = tmp | FCNF_TFIE_SET;
    } else {
        /* Clear SCxFCNF<TFIE> to disable transmit FIFO interrupt */
        UARTx->FCNF = tmp & FCNF_TFIE_CLEAR;
    }
}

/**
  * @brief  Bytes used in receive FIFO.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  BytesUsed: Bytes used in receive FIFO.
  *   This parameter can be: UART_RXFIFO_MAX or UART_RXFIFO_RXFLEVEL.
  * @retval None
  */
void UART_RxFIFOByteSel(TSB_SC_TypeDef * UARTx, uint32_t BytesUsed)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UATR_RXFIFO_BYTESUSED(BytesUsed));

    tmp = UARTx->FCNF;
    tmp &= FCNF_BIT567_CLEAR;
    tmp &= FCNF_RFST_CLEAR;
    tmp |= BytesUsed;
    UARTx->FCNF = tmp;
}

/**
  * @brief  Receive FIFO fill level to generate receive interrupts.
  * @param  UARTx: Select the UART channel.
  *   This parameter can be one of the following values:
  *   UART0, UART1, UART2, UART3.
  * @param  RxFIFOLevel: Receive FIFO fill level.
  *   This parameter can be one of the following values:
  *   UART_RXFIFO4B_FLEVLE_4_2B, UART_RXFIFO4B_FLEVLE_1_1B,
  *   UART_RXFIFO4B_FLEVLE_2_2B or UART_RXFIFO4B_FLEVLE_3_1B.
  *   This parameter can be one of the following values:
  * @retval None
  */
void UART_RxFIFOFillLevel(TSB_SC_TypeDef * UARTx, uint32_t RxFIFOLevel)
{
    uint32_t tmp = 0U;

    /* Check the parameters */
    assert_param(IS_UART_PERIPH(UARTx));
    assert_param(IS_UART_RXFIFO4B_FLEVLE(RxFIFOLevel));

